colinporth/seggerF7/BSP/stm32746g_lcd.cpp
// stm32746g_lcd.cpp
//{{{  includes
#include "../common/system.h"
#include "stm32746g_lcd.h"
#include "font.h"

extern const sFONT Font16;
//}}}
//{{{  defines
#define POLY_X(Z)           ((int32_t)((Points + Z)->X))
#define POLY_Y(Z)           ((int32_t)((Points + Z)->Y))
#define ABS(X)              ((X) > 0 ? (X) : -(X))

#define  RK043FN48H_HSYNC   ((uint16_t)41)   // Horizontal synchronization
#define  RK043FN48H_HBP     ((uint16_t)13)   // Horizontal back porch
#define  RK043FN48H_HFP     ((uint16_t)32)   // Horizontal front porch
#define  RK043FN48H_VSYNC   ((uint16_t)10)   // Vertical synchronization
#define  RK043FN48H_VBP     ((uint16_t)2)    // Vertical back porch
#define  RK043FN48H_VFP     ((uint16_t)2)    // Vertical front porch

#define  RK043FN48H_FREQUENCY_DIVIDER    5            // LCD Frequency divider
//}}}

//{{{  vars
LTDC_HandleTypeDef hLtdcHandler;
DMA2D_HandleTypeDef hDma2dHandler;
uint32_t ActiveLayer = 0;
LCD_DrawPropTypeDef DrawProp[MAX_LAYER_NUMBER];

uint32_t TextColor = LCD_COLOR_WHITE;
uint32_t BackColor = LCD_COLOR_BLACK;
//}}}
//{{{
void FillTriangle (uint16_t x1, uint16_t x2, uint16_t x3, uint16_t y1, uint16_t y2, uint16_t y3)
{
  int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, num_add = 0, num_pixels = 0,
  curpixel = 0;

  deltax = ABS(x2 - x1);        // The difference between the x's
  deltay = ABS(y2 - y1);        // The difference between the y's
  x = x1;                       // Start x off at the first pixel
  y = y1;                       // Start y off at the first pixel

  if (x2 >= x1) {                // The x-values are increasing
    xinc1 = 1;
    xinc2 = 1;
    }
  else {                         // The x-values are decreasing
    xinc1 = -1;
    xinc2 = -1;
    }

  if (y2 >= y1) {               // The y-values are increasing
    yinc1 = 1;
    yinc2 = 1;
    }
  else {                         // The y-values are decreasing
    yinc1 = -1;
    yinc2 = -1;
    }

  if (deltax >= deltay) {        // There is at least one x-value for every y-value
    xinc1 = 0;                  // Don't change the x when numerator >= denominator
    yinc2 = 0;                  // Don't change the y for every iteration
    den = deltax;
    num = deltax / 2;
    num_add = deltay;
    num_pixels = deltax;         // There are more x-values than y-values
    }
  else {                         // There is at least one y-value for every x-value
    xinc2 = 0;                  // Don't change the x for every iteration
    yinc1 = 0;                  // Don't change the y when numerator >= denominator
    den = deltay;
    num = deltay / 2;
    num_add = deltax;
    num_pixels = deltay;         // There are more y-values than x-values
    }

  for (curpixel = 0; curpixel <= num_pixels; curpixel++) {
    BSP_LCD_DrawLine(x, y, x3, y3);

    num += num_add;              // Increase the numerator by the top of the fraction
    if (num >= den)  {           // Check if numerator >= denominator
      num -= den;               // Calculate the new numerator value
      x += xinc1;               // Change the x as appropriate
      y += yinc1;               // Change the y as appropriate
      }
    x += xinc2;                 // Change the x as appropriate
    y += yinc2;                 // Change the y as appropriate
    }
  }
//}}}
//{{{
void FillBuffer (uint32_t layer, uint32_t dst, uint32_t xsize, uint32_t ysize, uint32_t OffLine, uint32_t color) {

  hDma2dHandler.Init.Mode = DMA2D_R2M;
  #ifdef RGB565
    hDma2dHandler.Init.ColorMode = DMA2D_RGB565;
  #else
    hDma2dHandler.Init.ColorMode = DMA2D_ARGB8888;
  #endif
  hDma2dHandler.Init.OutputOffset = OffLine;

  HAL_DMA2D_Init (&hDma2dHandler);
  HAL_DMA2D_ConfigLayer (&hDma2dHandler, layer);
  HAL_DMA2D_Start (&hDma2dHandler, color, dst, xsize, ysize);
  HAL_DMA2D_PollForTransfer (&hDma2dHandler, 10);
  }
//}}}
//{{{
void ConvertLineToARGB8888 (void* src, void* dst, uint32_t xSize, uint32_t ColorMode) {

  hDma2dHandler.Init.Mode = DMA2D_M2M_PFC;
  hDma2dHandler.Init.ColorMode = DMA2D_ARGB8888;
  hDma2dHandler.Init.OutputOffset = 0;

  // Foreground Configuration
  hDma2dHandler.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
  hDma2dHandler.LayerCfg[1].InputAlpha = 0xFF;
  hDma2dHandler.LayerCfg[1].InputColorMode = ColorMode;
  hDma2dHandler.LayerCfg[1].InputOffset = 0;

  if (HAL_DMA2D_Init (&hDma2dHandler) == HAL_OK)
    if (HAL_DMA2D_ConfigLayer (&hDma2dHandler, 1) == HAL_OK)
      if (HAL_DMA2D_Start (&hDma2dHandler, (uint32_t)src, (uint32_t)dst, xSize, 1) == HAL_OK)
        HAL_DMA2D_PollForTransfer (&hDma2dHandler, 10);
  }
//}}}

//{{{
uint8_t BSP_LCD_Init() {

  // The RK043FN48H LCD 480x272 is selected
  hLtdcHandler.Init.HorizontalSync = (RK043FN48H_HSYNC - 1);
  hLtdcHandler.Init.VerticalSync = (RK043FN48H_VSYNC - 1);
  hLtdcHandler.Init.AccumulatedHBP = (RK043FN48H_HSYNC + RK043FN48H_HBP - 1);
  hLtdcHandler.Init.AccumulatedVBP = (RK043FN48H_VSYNC + RK043FN48H_VBP - 1);
  hLtdcHandler.Init.AccumulatedActiveH = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP - 1);
  hLtdcHandler.Init.AccumulatedActiveW = (RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP - 1);
  hLtdcHandler.Init.TotalHeigh = (RK043FN48H_HEIGHT + RK043FN48H_VSYNC + RK043FN48H_VBP + RK043FN48H_VFP - 1);
  hLtdcHandler.Init.TotalWidth = (RK043FN48H_WIDTH + RK043FN48H_HSYNC + RK043FN48H_HBP + RK043FN48H_HFP - 1);

  // LCD clock configuration
  BSP_LCD_ClockConfig (&hLtdcHandler, NULL);

  // Initialize the LCD pixel width and pixel height
  hLtdcHandler.LayerCfg->ImageWidth = RK043FN48H_WIDTH;
  hLtdcHandler.LayerCfg->ImageHeight = RK043FN48H_HEIGHT;

  // Background value
  hLtdcHandler.Init.Backcolor.Blue = 0;
  hLtdcHandler.Init.Backcolor.Green = 0;
  hLtdcHandler.Init.Backcolor.Red = 0;

  // Polarity
  hLtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
  hLtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
  hLtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
  hLtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
  hLtdcHandler.Instance = LTDC;

