colinporth/seggerF7/BSP/stm32746g_lcd.cpp
  if (HAL_LTDC_GetState(&hLtdcHandler) == HAL_LTDC_STATE_RESET)
    BSP_LCD_MspInit (&hLtdcHandler, NULL);
  HAL_LTDC_Init (&hLtdcHandler);

  // Assert display enable LCD_DISP pin
  HAL_GPIO_WritePin (LCD_DISP_GPIO_PORT, LCD_DISP_PIN, GPIO_PIN_SET);

  // Assert backlight LCD_BL_CTRL pin
  HAL_GPIO_WritePin (LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);

  BSP_SDRAM_Init();

  hDma2dHandler.Instance = DMA2D;
  HAL_DMA2D_ConfigDeadTime (&hDma2dHandler, 20);
  HAL_DMA2D_EnableDeadTime (&hDma2dHandler);

  return LCD_OK;
  }
//}}}
//{{{
uint8_t BSP_LCD_DeInit() {

  // Initialize the hLtdcHandler Instance parameter
  hLtdcHandler.Instance = LTDC;

 // Disable LTDC block //
  __HAL_LTDC_DISABLE (&hLtdcHandler);

  // DeInit the LTDC
  HAL_LTDC_DeInit (&hLtdcHandler);

  // DeInit the LTDC MSP : this __weak function can be rewritten by the application
  BSP_LCD_MspDeInit (&hLtdcHandler, NULL);

  return LCD_OK;
  }
//}}}
//{{{
void BSP_LCD_LayerDefaultInit (uint16_t LayerIndex, uint32_t FB_Address) {


  // Layer Init
  LCD_LayerCfgTypeDef layer_cfg;
  layer_cfg.WindowX0 = 0;
  layer_cfg.WindowX1 = BSP_LCD_GetXSize();
  layer_cfg.WindowY0 = 0;
  layer_cfg.WindowY1 = BSP_LCD_GetYSize();
  layer_cfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
  //layer_cfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  layer_cfg.FBStartAdress = FB_Address;
  layer_cfg.Alpha = 255;
  layer_cfg.Alpha0 = 0;
  layer_cfg.Backcolor.Blue = 0;
  layer_cfg.Backcolor.Green = 0;
  layer_cfg.Backcolor.Red = 0;
  layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
  layer_cfg.ImageWidth = BSP_LCD_GetXSize();
  layer_cfg.ImageHeight = BSP_LCD_GetYSize();

  HAL_LTDC_ConfigLayer (&hLtdcHandler, &layer_cfg, LayerIndex);
  }
//}}}

void BSP_LCD_SelectLayer (uint32_t LayerIndex) { ActiveLayer = LayerIndex; }
//{{{
void BSP_LCD_SetLayerVisible (uint32_t LayerIndex, FunctionalState State) {

  if (State == ENABLE)
    __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
  else
    __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);

  __HAL_LTDC_RELOAD_CONFIG(&hLtdcHandler);
  }
//}}}
//{{{
void BSP_LCD_SetLayerVisible_NoReload (uint32_t LayerIndex, FunctionalState State) {

  if (State == ENABLE)
    __HAL_LTDC_LAYER_ENABLE(&hLtdcHandler, LayerIndex);
  else
    __HAL_LTDC_LAYER_DISABLE(&hLtdcHandler, LayerIndex);
  }
//}}}
//{{{
void BSP_LCD_SetTransparency (uint32_t LayerIndex, uint8_t Transparency) {
  HAL_LTDC_SetAlpha (&hLtdcHandler, Transparency, LayerIndex);
  }
//}}}
//{{{
void BSP_LCD_SetTransparency_NoReload (uint32_t LayerIndex, uint8_t Transparency) {
  HAL_LTDC_SetAlpha_NoReload (&hLtdcHandler, Transparency, LayerIndex);
  }
//}}}
//{{{
void BSP_LCD_SetLayerAddress (uint32_t LayerIndex, uint32_t Address) {
  HAL_LTDC_SetAddress (&hLtdcHandler, Address, LayerIndex);
  }
//}}}
//{{{
void BSP_LCD_SetLayerAddress_NoReload (uint32_t LayerIndex, uint32_t Address) {
  HAL_LTDC_SetAddress_NoReload (&hLtdcHandler, Address, LayerIndex);
  }
//}}}
void BSP_LCD_Reload (uint32_t ReloadType) { HAL_LTDC_Reload (&hLtdcHandler, ReloadType); }

uint16_t BSP_LCD_GetTextHeight() { return Font16.mHeight; }
uint32_t BSP_LCD_GetTextColor() { return TextColor; }
uint32_t BSP_LCD_GetBackColor() { return BackColor; }
void BSP_LCD_SetTextColor (uint32_t Color) { TextColor = Color; }
void BSP_LCD_SetBackColor (uint32_t Color) { BackColor = Color; }

//{{{
uint32_t BSP_LCD_ReadPixel (uint16_t Xpos, uint16_t Ypos) {

  if (hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_ARGB8888)
    // Read data value from SDRAM memory
    return *(__IO uint32_t*)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (4*(Ypos*BSP_LCD_GetXSize() + Xpos)));

  else if (hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB888)
    // Read data value from SDRAM memory
    return (*(__IO uint32_t*)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (4*(Ypos*BSP_LCD_GetXSize() + Xpos))) & 0x00FFFFFF);

  else if ((hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB565) || \
           (hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_ARGB4444) || \
           (hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_AL88))
    // Read data value from SDRAM memory
    return *(__IO uint16_t*)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (2*(Ypos*BSP_LCD_GetXSize() + Xpos)));

  else
    // Read data value from SDRAM memory
    return *(__IO uint8_t*)(hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (2*(Ypos*BSP_LCD_GetXSize() + Xpos)));
  }
//}}}

//{{{
void BSP_LCD_ClearStringLine (uint32_t Line) {

  // Draw rectangle with background color
  uint32_t color_backup = TextColor;
  TextColor = BackColor;
  BSP_LCD_FillRect (0, Line * Font16.mHeight, BSP_LCD_GetXSize(), Font16.mHeight);
  TextColor = color_backup;
  }
//}}}
//{{{
void BSP_LCD_DisplayChar (uint16_t x, uint16_t y, uint8_t ascii) {

  const uint16_t width = Font16.mWidth;
  const uint16_t byteAlignedWidth = (width+7)/8;
  const uint16_t offset = 8*(byteAlignedWidth) - width-1;
  const uint8_t* fontChar = &Font16.mTable [(ascii-' ') * Font16.mHeight * byteAlignedWidth];

  #ifdef RGB565
    auto fbPtr = ((uint16_t*)hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress) + (y * BSP_LCD_GetXSize()) + x;
  #else
    auto fbPtr = ((uint32_t*)hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress) + (y * BSP_LCD_GetXSize()) + x;
  #endif

  for (auto fontLine = 0u; fontLine < Font16.mHeight; fontLine++) {
    auto fontPtr = (uint8_t*)fontChar + byteAlignedWidth * fontLine;
    uint16_t fontLineBits = *fontPtr++;
    if (byteAlignedWidth == 2)
      fontLineBits = (fontLineBits << 8) | *fontPtr;
    if (fontLineBits) {
      uint16_t bit = 1 << (width + offset);
      auto endPtr = fbPtr + width;
      while (fbPtr != endPtr) {
        if (fontLineBits & bit)
          *fbPtr = TextColor;
        fbPtr++;
        bit >>= 1;
        }
      fbPtr += BSP_LCD_GetXSize() - width;
      }
    else
      fbPtr += BSP_LCD_GetXSize();
    }
  }
//}}}
//{{{
void BSP_LCD_DisplayStringAt (uint16_t x, uint16_t y, char* text, Text_AlignModeTypdef mode) {

  uint16_t column = 1;
  switch (mode) {
    case CENTER_MODE:  {
      uint32_t xSize = BSP_LCD_GetXSize() / Font16.mWidth;
      char* ptr = text;
      uint32_t size = 0;
      while (*ptr++)
        size++;
      column = x + ((xSize - size) * Font16.mWidth) / 2;
      break;
      }

