colinporth/seggerF7/BSP/stm32746g_lcd.cpp
    case RIGHT_MODE: {
      uint32_t xSize = BSP_LCD_GetXSize() / Font16.mWidth;
      char* ptr = text;
      uint32_t size = 0;
      while (*ptr++)
        size++;
      column = -x + ((xSize - size) * Font16.mWidth);
      break;
      }

    case LEFT_MODE:
      column = x;
      break;
    }

  // Check that the start x is on screen
  if ((column < 1) || (column >= BSP_LCD_GetXSize()))
    column = 1;

  while (*text && (column + Font16.mWidth < BSP_LCD_GetXSize())) {
    BSP_LCD_DisplayChar (column, y, *text++);
    column += Font16.mWidth;
    }
  }
//}}}
//{{{
void BSP_LCD_DisplayStringAtLine (uint16_t line, char* ptr) {
  BSP_LCD_DisplayStringAt (0, line * Font16.mHeight, ptr, LEFT_MODE);
  }
//}}}
//{{{
void BSP_LCD_DisplayStringAtLineColumn (uint16_t line, uint16_t column, char* ptr) {
  BSP_LCD_DisplayStringAt (column * Font16.mWidth, line * Font16.mHeight, ptr, LEFT_MODE);
  }
//}}}

//{{{
void BSP_LCD_DrawHLine (uint16_t Xpos, uint16_t Ypos, uint16_t Length) {
  FillBuffer (ActiveLayer,
              hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + 4*(BSP_LCD_GetXSize()*Ypos + Xpos), Length,
              1, 0, TextColor);
  }

//}}}
//{{{
void BSP_LCD_DrawVLine (uint16_t Xpos, uint16_t Ypos, uint16_t Length) {

  FillBuffer (ActiveLayer,
              hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + 4*(BSP_LCD_GetXSize()*Ypos + Xpos),
              1, Length, (BSP_LCD_GetXSize() - 1), TextColor);
  }
//}}}
//{{{
void BSP_LCD_DrawLine (uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {

  int16_t xinc1 = 0, xinc2 = 0, yinc1 = 0, yinc2 = 0, den = 0, num = 0, num_add = 0, num_pixels = 0;

  int16_t deltax = ABS(x2 - x1);        // The difference between the x's
  int16_t deltay = ABS(y2 - y1);        // The difference between the y's
  int16_t x = x1;                       // Start x off at the first pixel
  int16_t y = y1;                       // Start y off at the first pixel

  if (x2 >= x1) { // The x-values are increasing
    xinc1 = 1;
    xinc2 = 1;
    }
  else {          // The x-values are decreasing
    xinc1 = -1;
    xinc2 = -1;
    }

  if (y2 >= y1) { // The y-values are increasing
    yinc1 = 1;
    yinc2 = 1;
    }
  else {          // The y-values are decreasing
    yinc1 = -1;
    yinc2 = -1;
    }

  if (deltax >= deltay) {        // There is at least one x-value for every y-value
    xinc1 = 0;                  // Don't change the x when numerator >= denominator
    yinc2 = 0;                  // Don't change the y for every iteration
    den = deltax;
    num = deltax / 2;
    num_add = deltay;
    num_pixels = deltax;         // There are more x-values than y-values
    }
  else {                         // There is at least one y-value for every x-value
    xinc2 = 0;                  // Don't change the x for every iteration
    yinc1 = 0;                  // Don't change the y when numerator >= denominator
    den = deltay;
    num = deltay / 2;
    num_add = deltax;
    num_pixels = deltay;         // There are more y-values than x-values
    }

  for (int16_t curpixel = 0; curpixel <= num_pixels; curpixel++) {
    BSP_LCD_DrawPixel (x, y, TextColor);
    num += num_add;     // Increase the numerator by the top of the fraction
    if (num >= den) {   // Check if numerator >= denominator
      num -= den;       // Calculate the new numerator value
      x += xinc1;       // Change the x as appropriate
      y += yinc1;       // Change the y as appropriate
      }
    x += xinc2;         // Change the x as appropriate
    y += yinc2;         // Change the y as appropriate
    }
  }
//}}}
//{{{
void BSP_LCD_DrawRect (uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height) {

  // Draw horizontal lines
  BSP_LCD_DrawHLine (Xpos, Ypos, Width);
  BSP_LCD_DrawHLine (Xpos, (Ypos+ Height), Width);

  // Draw vertical lines
  BSP_LCD_DrawVLine (Xpos, Ypos, Height);
  BSP_LCD_DrawVLine ((Xpos + Width), Ypos, Height);
  }
//}}}
//{{{
void BSP_LCD_DrawCircle (uint16_t Xpos, uint16_t Ypos, uint16_t Radius) {

  int32_t decision;    // Decision Variable
  uint32_t current_x;   // Current X Value
  uint32_t current_y;   // Current Y Value

  decision = 3 - (Radius << 1);
  current_x = 0;
  current_y = Radius;

  while (current_x <= current_y) {
    BSP_LCD_DrawPixel ((Xpos + current_x), (Ypos - current_y), TextColor);
    BSP_LCD_DrawPixel ((Xpos - current_x), (Ypos - current_y), TextColor);
    BSP_LCD_DrawPixel ((Xpos + current_y), (Ypos - current_x), TextColor);
    BSP_LCD_DrawPixel ((Xpos - current_y), (Ypos - current_x), TextColor);
    BSP_LCD_DrawPixel ((Xpos + current_x), (Ypos + current_y), TextColor);
    BSP_LCD_DrawPixel ((Xpos - current_x), (Ypos + current_y), TextColor);
    BSP_LCD_DrawPixel ((Xpos + current_y), (Ypos + current_x), TextColor);
    BSP_LCD_DrawPixel ((Xpos - current_y), (Ypos + current_x), TextColor);

    if (decision < 0)
      decision += (current_x << 2) + 6;
    else {
      decision += ((current_x - current_y) << 2) + 10;
      current_y--;
      }
    current_x++;
    }
  }
//}}}
//{{{
void BSP_LCD_DrawPolygon (pPoint Points, uint16_t PointCount) {

  int16_t x = 0, y = 0;

  if (PointCount < 2)
    return;

  BSP_LCD_DrawLine (Points->X, Points->Y, (Points+PointCount-1)->X, (Points+PointCount-1)->Y);

  while(--PointCount) {
    x = Points->X;
    y = Points->Y;
    Points++;
    BSP_LCD_DrawLine (x, y, Points->X, Points->Y);
    }
  }
//}}}
//{{{
void BSP_LCD_DrawEllipse (int Xpos, int Ypos, int XRadius, int YRadius) {

  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float k = 0, rad1 = 0, rad2 = 0;

  rad1 = XRadius;
  rad2 = YRadius;

  k = (float)(rad2/rad1);

  do {
    BSP_LCD_DrawPixel((Xpos-(uint16_t)(x/k)), (Ypos+y), TextColor);
    BSP_LCD_DrawPixel((Xpos+(uint16_t)(x/k)), (Ypos+y), TextColor);
    BSP_LCD_DrawPixel((Xpos+(uint16_t)(x/k)), (Ypos-y), TextColor);
    BSP_LCD_DrawPixel((Xpos-(uint16_t)(x/k)), (Ypos-y), TextColor);

    e2 = err;
    if (e2 <= x) {
      err += ++x*2+1;
      if (-y == x && e2 <= y)
        e2 = 0;
      }
    if (e2 > y)
      err += ++y*2+1;
    }

  while (y <= 0);
  }
//}}}
//{{{
void BSP_LCD_DrawPixel (uint16_t Xpos, uint16_t Ypos, uint32_t RGB_Code) {
// Write data value to all SDRAM memory

  if (hLtdcHandler.LayerCfg[ActiveLayer].PixelFormat == LTDC_PIXEL_FORMAT_RGB565)
    *(__IO uint16_t*) (hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (2*(Ypos*BSP_LCD_GetXSize() + Xpos))) = (uint16_t)RGB_Code;
  else
    *(__IO uint32_t*) (hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (4*(Ypos*BSP_LCD_GetXSize() + Xpos))) = RGB_Code;
  }
//}}}
//{{{
void BSP_LCD_DrawBitmap (uint32_t Xpos, uint32_t Ypos, uint8_t *pbmp) {

