colinporth/seggerF7/BSP/stm32746g_lcd.cpp
  uint32_t index = 0, width = 0, height = 0, bit_pixel = 0;
  uint32_t address;
  uint32_t input_color_mode = 0;

  // Get bitmap data address offset
  index = pbmp[10] + (pbmp[11] << 8) + (pbmp[12] << 16)  + (pbmp[13] << 24);

  // Read bitmap width
  width = pbmp[18] + (pbmp[19] << 8) + (pbmp[20] << 16)  + (pbmp[21] << 24);

  // Read bitmap height
  height = pbmp[22] + (pbmp[23] << 8) + (pbmp[24] << 16)  + (pbmp[25] << 24);

  // Read bit/pixel
  bit_pixel = pbmp[28] + (pbmp[29] << 8);

  // Set the address
  address = hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + (((BSP_LCD_GetXSize()*Ypos) + Xpos)*(4));

  // Get the layer pixel format
  if ((bit_pixel/8) == 4)
    input_color_mode = CM_ARGB8888;
  else if ((bit_pixel/8) == 2)
    input_color_mode = CM_RGB565;
  else
    input_color_mode = CM_RGB888;

  // Bypass the bitmap header
  pbmp += (index + (width * (height - 1) * (bit_pixel/8)));

  // Convert picture to ARGB8888 pixel format
  for (index=0; index < height; index++) {
    // Pixel format conversion
    ConvertLineToARGB8888((uint32_t*)pbmp, (uint32_t*)address, width, input_color_mode);

    // Increment the source and destination buffers
    address+=  (BSP_LCD_GetXSize()*4);
    pbmp -= width*(bit_pixel/8);
    }
  }
//}}}

//{{{
void BSP_LCD_Clear (uint32_t Color) {
  FillBuffer (ActiveLayer, hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress, BSP_LCD_GetXSize(), BSP_LCD_GetYSize(), 0, Color);
  }
//}}}
//{{{
void BSP_LCD_FillRect (uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height) {

  FillBuffer (ActiveLayer,
              hLtdcHandler.LayerCfg[ActiveLayer].FBStartAdress + 4*(BSP_LCD_GetXSize()*Ypos + Xpos),
              Width, Height, (BSP_LCD_GetXSize() - Width), TextColor);
  }
//}}}
//{{{
void BSP_LCD_FillCircle (uint16_t Xpos, uint16_t Ypos, uint16_t Radius) {

  int32_t  decision;     // Decision Variable
  uint32_t  current_x;   // Current X Value
  uint32_t  current_y;   // Current Y Value
  decision = 3 - (Radius << 1);
  current_x = 0;
  current_y = Radius;

  while (current_x <= current_y) {
    if(current_y > 0) {
      BSP_LCD_DrawHLine (Xpos - current_y, Ypos + current_x, 2*current_y);
      BSP_LCD_DrawHLine (Xpos - current_y, Ypos - current_x, 2*current_y);
      }

    if(current_x > 0) {
      BSP_LCD_DrawHLine (Xpos - current_x, Ypos - current_y, 2*current_x);
      BSP_LCD_DrawHLine (Xpos - current_x, Ypos + current_y, 2*current_x);
      }
    if (decision < 0)
      decision += (current_x << 2) + 6;
    else {
      decision += ((current_x - current_y) << 2) + 10;
      current_y--;
      }
    current_x++;
    }

  BSP_LCD_DrawCircle (Xpos, Ypos, Radius);
  }
//}}}
//{{{
void BSP_LCD_FillPolygon (pPoint Points, uint16_t PointCount) {

  int16_t X = 0, Y = 0, X2 = 0, Y2 = 0, X_center = 0, Y_center = 0, X_first = 0, Y_first = 0, pixelX = 0, pixelY = 0, counter = 0;
  uint16_t  image_left = 0, image_right = 0, image_top = 0, image_bottom = 0;

  image_left = image_right = Points->X;
  image_top= image_bottom = Points->Y;

  for (counter = 1; counter < PointCount; counter++) {
    pixelX = POLY_X(counter);
    if(pixelX < image_left)
      image_left = pixelX;
    if(pixelX > image_right)
      image_right = pixelX;

    pixelY = POLY_Y(counter);
    if(pixelY < image_top)
      image_top = pixelY;
    if(pixelY > image_bottom)
      image_bottom = pixelY;
    }

  if (PointCount < 2)
    return;

  X_center = (image_left + image_right)/2;
  Y_center = (image_bottom + image_top)/2;

  X_first = Points->X;
  Y_first = Points->Y;

  while(--PointCount) {
    X = Points->X;
    Y = Points->Y;
    Points++;
    X2 = Points->X;
    Y2 = Points->Y;

    FillTriangle(X, X2, X_center, Y, Y2, Y_center);
    FillTriangle(X, X_center, X2, Y, Y_center, Y2);
    FillTriangle(X_center, X2, X, Y_center, Y2, Y);
    }

  FillTriangle(X_first, X2, X_center, Y_first, Y2, Y_center);
  FillTriangle(X_first, X_center, X2, Y_first, Y_center, Y2);
  FillTriangle(X_center, X2, X_first, Y_center, Y2, Y_first);
  }
//}}}
//{{{
void BSP_LCD_FillEllipse (int Xpos, int Ypos, int XRadius, int YRadius) {

  int x = 0, y = -YRadius, err = 2-2*XRadius, e2;
  float k = 0, rad1 = 0, rad2 = 0;

  rad1 = XRadius;
  rad2 = YRadius;

  k = (float)(rad2/rad1);
  do {
    BSP_LCD_DrawHLine((Xpos-(uint16_t)(x/k)), (Ypos+y), (2*(uint16_t)(x/k) + 1));
    BSP_LCD_DrawHLine((Xpos-(uint16_t)(x/k)), (Ypos-y), (2*(uint16_t)(x/k) + 1));

    e2 = err;
    if (e2 <= x) {
      err += ++x*2+1;
      if (-y == x && e2 <= y) e2 = 0;
      }
    if (e2 > y) err += ++y*2+1;
    }

  while (y <= 0);
  }
//}}}

//{{{
void BSP_LCD_ConvertFrame (uint16_t* src, uint32_t dst, uint16_t xsize, uint16_t ysize) {

  hDma2dHandler.Init.Mode = DMA2D_M2M_PFC;
  hDma2dHandler.Init.ColorMode = DMA2D_ARGB8888;
  hDma2dHandler.Init.OutputOffset = 0;

  hDma2dHandler.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
  hDma2dHandler.LayerCfg[1].InputAlpha = 0xFF;
  hDma2dHandler.LayerCfg[1].InputColorMode = CM_RGB565;
  hDma2dHandler.LayerCfg[1].InputOffset = 0;

  HAL_DMA2D_Init (&hDma2dHandler);
  HAL_DMA2D_ConfigLayer (&hDma2dHandler, 1);
  HAL_DMA2D_Start (&hDma2dHandler, (uint32_t)src, dst, xsize, ysize);
  HAL_DMA2D_PollForTransfer (&hDma2dHandler, 10);
  }
//}}}
//{{{
void BSP_LCD_ConvertFrameCpu (uint16_t* src, uint16_t srcXsize, uint16_t srcYsize,
                              uint32_t* dst, uint16_t xsize, uint16_t ysize) {

  int srcScale = (srcXsize / xsize) + 1;
  src += (((srcYsize/srcScale) - ysize) / 2) * srcXsize;

#ifdef RGB565
  auto dst565 = (uint16_t*)dst;
  dst565 += (xsize - (srcXsize/srcScale)) / 2;
  for (uint16_t y = 0; y < ysize; y++) {
    for (auto x = 0; x < srcXsize/srcScale; x++) {
        *dst565++ = *src;
      src += srcScale;
      }
    src += srcXsize;
    dst565 += xsize - (srcXsize/srcScale);
    }
#else
  dst += (xsize - srcXsize/2))/2;
  for (uint16_t y = 0; y < ysize; y++) {
    for (auto x = 0; x < srcXsize/2); x++) {
      *dst++ = 0xFF000000 | ((*src & 0xF800) << 8) | ((*src & 0x07E0) << 5) | ((*src & 0x001F) << 3);
      src += 2;
      }
    dst += xsize-(srcXsize/2);
    src += srcXsize;
    }
#endif
  }
//}}}
//{{{
void BSP_LCD_ConvertFrameCpu1 (uint16_t* src, uint16_t srcXsize, uint16_t srcYsize,
                               uint32_t* dst, uint16_t xsize, uint16_t ysize) {

  src += ((srcXsize-xsize)/2) + (((srcYsize - ysize) / 2) * srcXsize);

