colinporth/seggerF7/BSP/stm32746g_lcd.cpp
#ifdef RGB565
  auto dst565 = (uint16_t*)dst;
  for (uint16_t y = 0; y < ysize; y++) {
    memcpy (dst565, src, xsize*2);
    src += 800;
    dst565 += xsize;
    }
#else
  for (uint16_t y = 0; y < ysize; y++) {
    for (auto x = 0; x < xsize; x++) {
      *dst++ = 0xFF000000 | ((*src & 0xF800) << 8) | ((*src & 0x07E0) << 5) | ((*src & 0x001F) << 3);
      src++;
      }
    src += srcXsize - xsize;
    }
#endif
  }
//}}}
//{{{
void BSP_LCD_ConvertFrameYuv (uint8_t* src, uint16_t srcXsize, uint16_t srcYsize,
                              uint8_t* dst, uint16_t x, uint16_t y, uint16_t xsize, uint16_t ysize) {

  //{{{
  static const uint32_t yTable [256] = {
    0x7FFFFFEDu,
    0x7FFFFFEFu,
    0x7FFFFFF0u,
    0x7FFFFFF1u,
    0x7FFFFFF2u,
    0x7FFFFFF3u,
    0x7FFFFFF4u,
    0x7FFFFFF6u,
    0x7FFFFFF7u,
    0x7FFFFFF8u,
    0x7FFFFFF9u,
    0x7FFFFFFAu,
    0x7FFFFFFBu,
    0x7FFFFFFDu,
    0x7FFFFFFEu,
    0x7FFFFFFFu,
    0x80000000u,
    0x80400801u,
    0x80A01002u,
    0x80E01803u,
    0x81202805u,
    0x81803006u,
    0x81C03807u,
    0x82004008u,
    0x82604809u,
    0x82A0500Au,
    0x82E0600Cu,
    0x8340680Du,
    0x8380700Eu,
    0x83C0780Fu,
    0x84208010u,
    0x84608811u,
    0x84A09813u,
    0x8500A014u,
    0x8540A815u,
    0x8580B016u,
    0x85E0B817u,
    0x8620C018u,
    0x8660D01Au,
    0x86C0D81Bu,
    0x8700E01Cu,
    0x8740E81Du,
    0x87A0F01Eu,
    0x87E0F81Fu,
    0x88210821u,
    0x88811022u,
    0x88C11823u,
    0x89012024u,
    0x89412825u,
    0x89A13026u,
    0x89E14028u,
    0x8A214829u,
    0x8A81502Au,
    0x8AC1582Bu,
    0x8B01602Cu,
    0x8B61682Du,
    0x8BA1782Fu,
    0x8BE18030u,
    0x8C418831u,
    0x8C819032u,
    0x8CC19833u,
    0x8D21A034u,
    0x8D61B036u,
    0x8DA1B837u,
    0x8E01C038u,
    0x8E41C839u,
    0x8E81D03Au,
    0x8EE1D83Bu,
    0x8F21E83Du,
    0x8F61F03Eu,
    0x8FC1F83Fu,
    0x90020040u,
    0x90420841u,
    0x90A21042u,
    0x90E22044u,
    0x91222845u,
    0x91823046u,
    0x91C23847u,
    0x92024048u,
    0x92624849u,
    0x92A2504Au,
    0x92E2604Cu,
    0x9342684Du,
    0x9382704Eu,
    0x93C2784Fu,
    0x94228050u,
    0x94628851u,
    0x94A29853u,
    0x9502A054u,
    0x9542A855u,
    0x9582B056u,
    0x95E2B857u,
    0x9622C058u,
    0x9662D05Au,
    0x96C2D85Bu,
    0x9702E05Cu,
    0x9742E85Du,
    0x97A2F05Eu,
    0x97E2F85Fu,
    0x98230861u,
    0x98831062u,
    0x98C31863u,
    0x99032064u,
    0x99632865u,
    0x99A33066u,
    0x99E34068u,
    0x9A434869u,
    0x9A83506Au,
    0x9AC3586Bu,
    0x9B23606Cu,
    0x9B63686Du,
    0x9BA3786Fu,
    0x9BE38070u,
    0x9C438871u,
    0x9C839072u,
    0x9CC39873u,
    0x9D23A074u,
    0x9D63B076u,
    0x9DA3B877u,
    0x9E03C078u,
    0x9E43C879u,
    0x9E83D07Au,
    0x9EE3D87Bu,
    0x9F23E87Du,
    0x9F63F07Eu,
    0x9FC3F87Fu,
    0xA0040080u,
    0xA0440881u,
    0xA0A41082u,
    0xA0E42084u,
    0xA1242885u,
    0xA1843086u,
    0xA1C43887u,
    0xA2044088u,
    0xA2644889u,
    0xA2A4588Bu,
    0xA2E4608Cu,
    0xA344688Du,
    0xA384708Eu,
    0xA3C4788Fu,
    0xA4248090u,
    0xA4649092u,
    0xA4A49893u,
    0xA504A094u,
    0xA544A895u,
    0xA584B096u,
    0xA5E4B897u,
    0xA624C098u,
    0xA664D09Au,
    0xA6C4D89Bu,
    0xA704E09Cu,
    0xA744E89Du,
    0xA7A4F09Eu,
    0xA7E4F89Fu,
    0xA82508A1u,
    0xA88510A2u,
    0xA8C518A3u,
    0xA90520A4u,
    0xA96528A5u,
    0xA9A530A6u,
    0xA9E540A8u,
    0xAA4548A9u,
    0xAA8550AAu,
    0xAAC558ABu,
    0xAB2560ACu,
    0xAB6568ADu,
    0xABA578AFu,
    0xAC0580B0u,
    0xAC4588B1u,
    0xAC8590B2u,
    0xACE598B3u,
    0xAD25A0B4u,
    0xAD65B0B6u,
    0xADA5B8B7u,
    0xAE05C0B8u,
    0xAE45C8B9u,
    0xAE85D0BAu,
    0xAEE5D8BBu,
    0xAF25E8BDu,
    0xAF65F0BEu,
    0xAFC5F8BFu,
    0xB00600C0u,
    0xB04608C1u,
    0xB0A610C2u,
    0xB0E620C4u,
    0xB12628C5u,
    0xB18630C6u,
    0xB1C638C7u,
    0xB20640C8u,
    0xB26648C9u,
    0xB2A658CBu,
    0xB2E660CCu,
    0xB34668CDu,
    0xB38670CEu,
    0xB3C678CFu,
    0xB42680D0u,
    0xB46690D2u,
    0xB4A698D3u,
    0xB506A0D4u,
    0xB546A8D5u,
    0xB586B0D6u,
    0xB5E6B8D7u,
    0xB626C8D9u,
    0xB666D0DAu,
    0xB6C6D8DBu,
    0xB706E0DCu,
    0xB746E8DDu,
    0xB7A6F0DEu,
    0xB7E6F8DFu,
    0xB82708E1u,
    0xB88710E2u,
    0xB8C718E3u,
    0xB90720E4u,
    0xB96728E5u,
    0xB9A730E6u,
    0xB9E740E8u,
    0xBA4748E9u,
    0xBA8750EAu,
    0xBAC758EBu,
    0xBB2760ECu,
    0xBB6768EDu,
    0xBBA778EFu,
    0xBC0780F0u,
    0xBC4788F1u,
    0xBC8790F2u,
    0xBCE798F3u,
    0xBD27A0F4u,
    0xBD67B0F6u,
    0xBDC7B8F7u,
    0xBE07C0F8u,
    0xBE47C8F9u,
    0xBEA7D0FAu,
    0xBEE7D8FBu,
    0xBF27E8FDu,
    0xBF87F0FEu,
    0xBFC7F8FFu,
    0xC0080100u,
    0xC0480901u,
    0xC0A81102u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    0xC0E82104u,
    };
  //}}}
  //{{{
  static const uint32_t uTable [256] = {
    0x0C400103u,
    0x0C200105u,
    0x0C200107u,
    0x0C000109u,
    0x0BE0010Bu,
    0x0BC0010Du,
    0x0BA0010Fu,
    0x0BA00111u,
    0x0B800113u,
    0x0B600115u,
    0x0B400117u,
    0x0B400119u,
    0x0B20011Bu,
    0x0B00011Du,
    0x0AE0011Fu,
    0x0AE00121u,
    0x0AC00123u,
    0x0AA00125u,
    0x0A800127u,
    0x0A600129u,
    0x0A60012Bu,
    0x0A40012Du,
    0x0A20012Fu,
    0x0A000131u,
    0x0A000132u,
    0x09E00134u,
    0x09C00136u,
    0x09A00138u,
    0x09A0013Au,
    0x0980013Cu,
    0x0960013Eu,
    0x09400140u,
    0x09400142u,
    0x09200144u,
    0x09000146u,
    0x08E00148u,
    0x08C0014Au,
    0x08C0014Cu,
    0x08A0014Eu,
    0x08800150u,
    0x08600152u,
    0x08600154u,
    0x08400156u,
    0x08200158u,
    0x0800015Au,
    0x0800015Cu,
    0x07E0015Eu,
    0x07C00160u,
    0x07A00162u,
    0x07A00164u,
    0x07800166u,
    0x07600168u,
    0x0740016Au,
    0x0720016Cu,
    0x0720016Eu,
    0x07000170u,
    0x06E00172u,
    0x06C00174u,
    0x06C00176u,
    0x06A00178u,
    0x0680017Au,
    0x0660017Cu,
    0x0660017Eu,
    0x06400180u,
    0x06200182u,
    0x06000184u,
    0x05E00185u,
    0x05E00187u,
    0x05C00189u,
    0x05A0018Bu,
    0x0580018Du,
    0x0580018Fu,
    0x05600191u,
    0x05400193u,
    0x05200195u,
    0x05200197u,
    0x05000199u,
    0x04E0019Bu,
    0x04C0019Du,
    0x04C0019Fu,
    0x04A001A1u,
    0x048001A3u,
    0x046001A5u,
    0x044001A7u,
    0x044001A9u,
    0x042001ABu,
    0x040001ADu,
    0x03E001AFu,
    0x03E001B1u,
    0x03C001B3u,
    0x03A001B5u,
    0x038001B7u,
    0x038001B9u,
    0x036001BBu,
    0x034001BDu,
    0x032001BFu,
    0x032001C1u,
    0x030001C3u,
    0x02E001C5u,
    0x02C001C7u,
    0x02A001C9u,
    0x02A001CBu,
    0x028001CDu,
    0x026001CFu,
    0x024001D1u,
    0x024001D3u,
    0x022001D5u,
    0x020001D7u,
    0x01E001D8u,
    0x01E001DAu,
    0x01C001DCu,
    0x01A001DEu,
    0x018001E0u,
    0x016001E2u,
    0x016001E4u,
    0x014001E6u,
    0x012001E8u,
    0x010001EAu,
    0x010001ECu,
    0x00E001EEu,
    0x00C001F0u,
    0x00A001F2u,
    0x00A001F4u,
    0x008001F6u,
    0x006001F8u,
    0x004001FAu,
    0x004001FCu,
    0x002001FEu,
    0x00000200u,
    0xFFE00202u,
    0xFFC00204u,
    0xFFC00206u,
    0xFFA00208u,
    0xFF80020Au,
    0xFF60020Cu,
    0xFF60020Eu,
    0xFF400210u,
    0xFF200212u,
    0xFF000214u,
    0xFF000216u,
    0xFEE00218u,
    0xFEC0021Au,
    0xFEA0021Cu,
    0xFEA0021Eu,
    0xFE800220u,
    0xFE600222u,
    0xFE400224u,
    0xFE200226u,
    0xFE200228u,
    0xFE000229u,
    0xFDE0022Bu,
    0xFDC0022Du,
    0xFDC0022Fu,
    0xFDA00231u,
    0xFD800233u,
    0xFD600235u,
    0xFD600237u,
    0xFD400239u,
    0xFD20023Bu,
    0xFD00023Du,
    0xFCE0023Fu,
    0xFCE00241u,
    0xFCC00243u,
    0xFCA00245u,
    0xFC800247u,
    0xFC800249u,
    0xFC60024Bu,
    0xFC40024Du,
    0xFC20024Fu,
    0xFC200251u,
    0xFC000253u,
    0xFBE00255u,
    0xFBC00257u,
    0xFBC00259u,
    0xFBA0025Bu,
    0xFB80025Du,
    0xFB60025Fu,
    0xFB400261u,
    0xFB400263u,
    0xFB200265u,
    0xFB000267u,
    0xFAE00269u,
    0xFAE0026Bu,
    0xFAC0026Du,
    0xFAA0026Fu,
    0xFA800271u,
    0xFA800273u,
    0xFA600275u,
    0xFA400277u,
    0xFA200279u,
    0xFA20027Bu,
    0xFA00027Cu,
    0xF9E0027Eu,
    0xF9C00280u,
    0xF9A00282u,
    0xF9A00284u,
    0xF9800286u,
    0xF9600288u,
    0xF940028Au,
    0xF940028Cu,
    0xF920028Eu,
    0xF9000290u,
    0xF8E00292u,
    0xF8E00294u,
    0xF8C00296u,
    0xF8A00298u,
    0xF880029Au,
    0xF860029Cu,
    0xF860029Eu,
    0xF84002A0u,
    0xF82002A2u,
    0xF80002A4u,
    0xF80002A6u,
    0xF7E002A8u,
    0xF7C002AAu,
    0xF7A002ACu,
    0xF7A002AEu,
    0xF78002B0u,
    0xF76002B2u,
    0xF74002B4u,
    0xF74002B6u,
    0xF72002B8u,
    0xF70002BAu,
    0xF6E002BCu,
    0xF6C002BEu,
    0xF6C002C0u,
    0xF6A002C2u,
    0xF68002C4u,
    0xF66002C6u,
    0xF66002C8u,
    0xF64002CAu,
    0xF62002CCu,
    0xF60002CEu,
    0xF60002CFu,
    0xF5E002D1u,
    0xF5C002D3u,
    0xF5A002D5u,
    0xF5A002D7u,
    0xF58002D9u,
    0xF56002DBu,
    0xF54002DDu,
    0xF52002DFu,
    0xF52002E1u,
    0xF50002E3u,
    0xF4E002E5u,
    0xF4C002E7u,
    0xF4C002E9u,
    0xF4A002EBu,
    0xF48002EDu,
    0xF46002EFu,
    0xF46002F1u,
    0xF44002F3u,
    0xF42002F5u,
    0xF40002F7u,
    0xF3E002F9u,
    0xF3E002FBu,
    };
  //}}}
  //{{{
  static const uint32_t vTable [256] = {
    0x1A09A000u,
    0x19E9A800u,
    0x19A9B800u,
    0x1969C800u,
    0x1949D000u,
    0x1909E000u,
    0x18C9E800u,
    0x18A9F800u,
    0x186A0000u,
    0x182A1000u,
    0x180A2000u,
    0x17CA2800u,
    0x17AA3800u,
    0x176A4000u,
    0x172A5000u,
    0x170A6000u,
    0x16CA6800u,
    0x168A7800u,
    0x166A8000u,
    0x162A9000u,
    0x160AA000u,
    0x15CAA800u,
    0x158AB800u,
    0x156AC000u,
    0x152AD000u,
    0x14EAE000u,
    0x14CAE800u,
    0x148AF800u,
    0x146B0000u,
    0x142B1000u,
    0x13EB2000u,
    0x13CB2800u,
    0x138B3800u,
    0x134B4000u,
    0x132B5000u,
    0x12EB6000u,
    0x12CB6800u,
    0x128B7800u,
    0x124B8000u,
    0x122B9000u,
    0x11EBA000u,
    0x11ABA800u,
    0x118BB800u,
    0x114BC000u,
    0x112BD000u,
    0x10EBE000u,
    0x10ABE800u,
    0x108BF800u,
    0x104C0000u,
    0x100C1000u,
    0x0FEC2000u,
    0x0FAC2800u,
    0x0F8C3800u,
    0x0F4C4000u,
    0x0F0C5000u,
    0x0EEC5800u,
    0x0EAC6800u,
    0x0E6C7800u,
    0x0E4C8000u,
    0x0E0C9000u,
    0x0DEC9800u,
    0x0DACA800u,
    0x0D6CB800u,
    0x0D4CC000u,
    0x0D0CD000u,
    0x0CCCD800u,
    0x0CACE800u,
    0x0C6CF800u,
    0x0C4D0000u,
    0x0C0D1000u,
    0x0BCD1800u,
    0x0BAD2800u,
    0x0B6D3800u,
    0x0B2D4000u,
    0x0B0D5000u,
    0x0ACD5800u,
    0x0AAD6800u,
    0x0A6D7800u,
    0x0A2D8000u,
    0x0A0D9000u,
    0x09CD9800u,
    0x098DA800u,
    0x096DB800u,
    0x092DC000u,
    0x090DD000u,
    0x08CDD800u,
    0x088DE800u,
    0x086DF800u,
    0x082E0000u,
    0x07EE1000u,
    0x07CE1800u,
    0x078E2800u,
    0x076E3800u,
    0x072E4000u,
    0x06EE5000u,
    0x06CE5800u,
    0x068E6800u,
    0x064E7800u,
    0x062E8000u,
    0x05EE9000u,
    0x05CE9800u,
    0x058EA800u,
    0x054EB800u,
    0x052EC000u,
    0x04EED000u,
    0x04AED800u,
    0x048EE800u,
    0x044EF000u,
    0x042F0000u,
    0x03EF1000u,
    0x03AF1800u,
    0x038F2800u,
    0x034F3000u,
    0x030F4000u,
    0x02EF5000u,
    0x02AF5800u,
    0x028F6800u,
    0x024F7000u,
    0x020F8000u,
    0x01EF9000u,
    0x01AF9800u,
    0x016FA800u,
    0x014FB000u,
    0x010FC000u,
    0x00EFD000u,
    0x00AFD800u,
    0x006FE800u,
    0x004FF000u,
    0x00100000u,
    0xFFD01000u,
    0xFFB01800u,
    0xFF702800u,
    0xFF303000u,
    0xFF104000u,
    0xFED05000u,
    0xFEB05800u,
    0xFE706800u,
    0xFE307000u,
    0xFE108000u,
    0xFDD09000u,
    0xFD909800u,
    0xFD70A800u,
    0xFD30B000u,
    0xFD10C000u,
    0xFCD0D000u,
    0xFC90D800u,
    0xFC70E800u,
    0xFC30F000u,
    0xFBF10000u,
    0xFBD11000u,
    0xFB911800u,
    0xFB712800u,
    0xFB313000u,
    0xFAF14000u,
    0xFAD14800u,
    0xFA915800u,
    0xFA516800u,
    0xFA317000u,
    0xF9F18000u,
    0xF9D18800u,
    0xF9919800u,
    0xF951A800u,
    0xF931B000u,
    0xF8F1C000u,
    0xF8B1C800u,
    0xF891D800u,
    0xF851E800u,
    0xF831F000u,
    0xF7F20000u,
    0xF7B20800u,
    0xF7921800u,
    0xF7522800u,
    0xF7123000u,
    0xF6F24000u,
    0xF6B24800u,
    0xF6925800u,
    0xF6526800u,
    0xF6127000u,
    0xF5F28000u,
    0xF5B28800u,
    0xF5729800u,
    0xF552A800u,
    0xF512B000u,
    0xF4F2C000u,
    0xF4B2C800u,
    0xF472D800u,
    0xF452E800u,
    0xF412F000u,
    0xF3D30000u,
    0xF3B30800u,
    0xF3731800u,
    0xF3532800u,
    0xF3133000u,
    0xF2D34000u,
    0xF2B34800u,
    0xF2735800u,
    0xF2336800u,
    0xF2137000u,
    0xF1D38000u,
    0xF1B38800u,
    0xF1739800u,
    0xF133A800u,
    0xF113B000u,
    0xF0D3C000u,
    0xF093C800u,
    0xF073D800u,
    0xF033E000u,
    0xF013F000u,
    0xEFD40000u,
    0xEF940800u,
    0xEF741800u,
    0xEF342000u,
    0xEEF43000u,
    0xEED44000u,
    0xEE944800u,
    0xEE745800u,
    0xEE346000u,
    0xEDF47000u,
    0xEDD48000u,
    0xED948800u,
    0xED549800u,
    0xED34A000u,
    0xECF4B000u,
    0xECD4C000u,
    0xEC94C800u,
    0xEC54D800u,
    0xEC34E000u,
    0xEBF4F000u,
    0xEBB50000u,
    0xEB950800u,
    0xEB551800u,
    0xEB352000u,
    0xEAF53000u,
    0xEAB54000u,
    0xEA954800u,
    0xEA555800u,
    0xEA156000u,
    0xE9F57000u,
    0xE9B58000u,
    0xE9958800u,
    0xE9559800u,
    0xE915A000u,
    0xE8F5B000u,
    0xE8B5C000u,
    0xE875C800u,
    0xE855D800u,
    0xE815E000u,
    0xE7F5F000u,
    0xE7B60000u,
    0xE7760800u,
    0xE7561800u,
    0xE7162000u,
    0xE6D63000u,
    0xE6B64000u,
    0xE6764800u,
    0xE6365800U
    };
  //}}}

  dst += ((y * xsize) + x) * 4;

  for (y = 0; y < srcYsize; y++) {
    for (x = 0; x < srcXsize/2; x++) {
      // read yuv pair
      uint8_t y1 = *src++;
      uint8_t u = *src++;
      uint8_t y2 = *src++;
      uint8_t v = *src++;

      uint32_t uv = uTable[u] | vTable[v];

      uint32_t yuv = yTable[y1] + uv;
      int tmp = yuv & 0x40080100;
      if (tmp) {
        tmp -= tmp >> 8;
        yuv |= tmp;
        tmp = 0x40080100 & ~(yuv >> 1);
        yuv += tmp >> 8;
        }
      *dst++ = yuv;
      *dst++ = yuv >> 22;
      *dst++ = yuv >> 11;
      *dst++ = 0xFF;

      yuv = yTable[y2] + uv;
      tmp = yuv & 0x40080100;
      if (tmp) {
        tmp -= tmp >> 8;
        yuv |= tmp;
        tmp = 0x40080100 & ~(yuv >> 1);
        yuv += tmp >> 8;
        }
      *dst++ = yuv;
      *dst++ = yuv >> 22;
      *dst++ = yuv >> 11;
      *dst++ = 0xFF;
      }
    dst += (xsize - srcXsize) * 4;
    }
  }
//}}}

